GetTemplateParameterIds Method
 Returns a list of parameter ids that may be controlled when this view is assigned as a template.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  Since:  2013
 Syntax
  C#
public IList<ElementId> GetTemplateParameterIds()
  Visual Basic
Public Function GetTemplateParameterIds As IList(Of ElementId)
  Visual C++
public:
IList<ElementId^>^ GetTemplateParameterIds()
 Return Value
 The parameter ids that may be controlled.
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →